# #1
# slovar = {"Россия": "Москва", "Япония": "Токио", "Франция": "Париж", "Сербия": "Белград", "Германия": "Берлин", "США": "Вашингтон",
# "Нидерланды": "Амстердам", "Греция": "Афины", "Великобритания": "Лондон"}
# print("Пары (ключ-значение):")
# for country, stolica in slovar.items():
#     print(f"{country}: {stolica}")
# country_name = input("Введите название страны: ")
# if country_name in slovar:
#     print(f"Столица страны {country_name}: {slovar[country_name]}")
# else:
#     print(f"Информация о столице {country_name} отсутствует.")
# sorted_slovar = dict(sorted(slovar.items()))
# print("\nОтсортированный словарь:")
# for country, stolica in sorted_slovar.items():
#     print(f"{country}: {stolica}")

# #2
# letters = {
#     "А": 1, "В": 1, "Е": 1, "И": 1, "Н": 1, "О": 1, "Р": 1, "С": 1, "Т": 1,
#     "Д": 2, "К": 2, "Л": 2, "М": 2, "П": 2, "У": 2,
#     "Б": 3, "Г": 3, "Ё": 3, "Ь": 3, "Я": 3,
#     "Й": 4, "Ы": 4,
#     "Ж": 5, "З": 5, "Х": 5, "Ц": 5, "Ч": 5,
#     "Ш": 8, "Э": 8, "Ю": 8,
#     "Ф": 10, "Щ": 10, "Ъ": 10
# }
# word = input("Введите слово, и узнаешь сколько оно стоит : )  ").upper()
# total_price = 0
# for letter in word:
#     if letter in letters:
#         total_price += letters[letter]
# print(f"Итоговая цена вашего слова составляет: {total_price}")

# # 3*
# students = {
#     "Студент 1": {"Русский,", "Китайский,"},
#     "Студент 2": {"Английский,", "Французский,"},
#     "Студент 3": {"Русский,", "Английский,", "Китайский,"},
#     "Студент 4": {"Испанский,", "Английский,", "Китайский,"},
#     "Студент 5": {"Немецкий,", "Русский,"},
#     "Студент 6": {"Итальянский,", "Испанский,", "Английский,"},
#     "Студент 7": {"Португальский,", "Английский,"},
#     "Студент 8": {"Японский.", "Корейский,", "Английский,"},
#     "Студент 9": {"Арабский,", "Французский,"},
#     "Студент 10": {"Хинди,", "Английский,"},
#     "Студент 11": {"Русский,", "Немецкий,", "Английский,"},
#     "Студент 12": {"Французский,", "Испанский,", "Английский,"},
#     "Студент 13": {"Китайский,", "Японский."},
#     "Студент 14": {"Корейский,", "Английский,"},
#     "Студент 15": {"Итальянский,"},
#     "Студент 16": {"Английский,", "Русский,", "Вьетнамский,", "Французский,"},
#     "Студент 17": {"Португальский,"},
#     "Студент 18": {"Турецкий,", "Английский,"},
#     "Студент 19": {"Шведский,", "Английский,"},
#     "Студент 20": {"Испанский,", "Французский,"},
#     "Студент 21": {"Английский,"},
#     "Студент 22": {"Русский,", "Белорусский,"},
#     "Студент 23": {"Польский,", "Немецкий,", "Английский,"},
#     "Студент 24": {"Греческий,", "Английский,"},
#     "Студент 25": {"Нидерландский,", "Английский,"}
# }
# all_languages = set()
# for languages in students.values():
#     all_languages.update(languages)
# print("\nРазличные языки:", ' '.join(sorted(list(all_languages))))
# china_people = []
# for student, languages in students.items():
#     if "Китайский," in languages:
#         china_people.append(student)
# print("Студенты, знающие китайский:", ' '.join(china_people))